// Комментирование - нужно использовать для описания того как работает код и почему
// или для того чтобы убрать кусок кода из интерпретации, браузер не выполняет комментарии


// Однострочный комментарий!


/*
    Многострочный комментарий
    выглядит вот так!
 */


// Инструкции

// Bad
console.log('Hello from condole!'); alert('Hello form alert window');


// Good
console.log('Hello from condole!');
alert('Hello form alert window');


// Точка с запятой

/*
 Несмотря на то что JavaScript при интерпретации автоматически вставляет точку с запятой
 при каждом переносе строки, в некоторых случаях этого не происходит, для того чтобы не
 столкнуться такими ошибками рекомендую всегда ставить "точку с запятой".
*/
